http://image.ichannela.com/webdata/2019_03/img_concept_2019_03_27_045305212.jpg
---
layout: post
title: 굿피플_신입사원 탄생기
categories: review
tags: [video,law,intern]
---

<img src="http://image.ichannela.com/webdata/2019_03/img_concept_2019_03_27_045305212.jpg" style="width: 50%; height: auto;">
2주라는 긴 격리기간동안 본 프로그램이다. 영화말고 이런식으로 비디오를 본 적이 없었는데 2주동안 아무것도 안하고 침대에서 있어야 하다보니 처음에는 '공부만 해야지!' 했다가
정신차려보니 휴대폰을 잡고있는 나를 보고, 꾸준히 봐야겠다 하고 막판에 몰아봤다.

현영이가 추천해줬던 프로그램인데 사실 처음에 추천해줬을 때는 에이 뭐 얼마나 재밌겠어 싶어서 1화만 보고 말아야겠다 했었다. 아주 오만한 생각이었다. 보다보니까
재밌기도 했지만, 무엇보다 매번 내 새끼들이(?) 잘 해냈겠지? 하는 조마조마한 마음으로 보게돼서 너무 집중해서 봤다. (당연히 형님,누님들이지만
뭔가 감정이입되기보단 응원하는 마음으로 봤던 것 같다.) 이주미 인턴님이 우실 때는 진짜 마음이 아팠고 이상호 인턴님이 주변 사람들을 편하게 해주는 모습을 보고
진짜 멋있다고도 생각했다.

사실 전혀 관심없는 분야의 인턴들이 나와서 경쟁을 했다면 재미없다고 생각을 했을 수도 있지만 로스쿨인턴. 진짜 멋있는 것 같다. 내가 산업공학이 아닌
문과계열의 진로를 고등학교 때 선택했다면 나는 무조건 리트를 공부하고 있을 것 같다. 그만큼 관심있고 흥미를 느끼는 게 법조인이다. 작년에
'친애하는 판사님께'라는 드라마를 유튜브 클립으로 쭉 정주행한 적이 있었는데 판사가 너무 멋있어 보였고 나도 몸이 두개라면 그런 인생을 한번쯤 살아보고 싶다고 느꼈다.

당연히 아직은 내가 어떤 길을 가게 될지 모르겠지만, 기회비용상(사실 기회비용보단 매몰비용에 대한 걱정이 더 크다.) 법조인의 방향으로 가는 것이 쉽지 않을 것 같다.
그렇기에 인턴분들이 더 멋있다고 느꼈는지도 모른다. 처음에는 잘생기고 예쁜 분들이 그니까 흔히 말하는 '잘난' 분들의 이야기일 줄 알았는데 8인 모두
인간적인 모습을 보여주면서 인턴생활을 하는 걸 보니 나도 더 힘을 내서 살아야겠다고도 생각했다.

인턴분들도 멋있었고 그분들을 성장시킨(?) 변호사님들도 멋있었고... 그냥 다 멋있었다. 나도 멋있는 사람이 될 거다.

굿피플을 보고 얻은 것 3가지
- 차선으로 선택할만한 길은 아니지만, 법조인으로서의 삶도 멋있는 것 같다.
- 무슨 일을 하느냐보다 누구랑 일하느냐가 중요하다.
- 잘하는 일도 좋지만 흥미를 가지고 몰입할 수 있는 일이 더 좋다. 후자는 결국 좋은 결과를 낼테니까.
