---
layout: post
title: 진짜 진짜 끝 이제 안건드릴래
categories: [daily]
tags: [coding, github_page]
---

어제 연등시간부터 오늘 3시 8분까지. 너무나도 고치고 싶은 문제가 눈에 확 들어와 버려서 근무시간 빼고 틈틈히 해서 한 3시간? 3시간반? 동안 고쳤다.
사이드바에 각 글에 대한 카테고리를 만들고 그 카테고리로 들어가면 태그별로 정리를 해뒀는데 글 6개정도를 등록해버리니 태그가 너무 많았고
특히 Daily랑 Review랑 쓰는 태그가 크게 겹치지 않아버리니 쓸데없이 빈 태그들만 쭉 나열되는게 꼴보기 싫었다.

당연히 이걸 걱정하지 않았던 것은 아니다. 처음 카테고리, 태그별 페이지를 만들 때도 이런걸 고려했었지만, html과 liquid 언어가 낯설었고 무엇보다 내가 긁어 올 수 있거나 참고할 수 있는 글에선
내가 원하는 기능대로 작동하지 않았다. 그렇게 포기하고 완성! 하려고 했는데 너무 너무 아쉬워서 하루만 더 쓰자고 생각했다.

이제는 내가 원하는 대로 됐다. 해당 카테고리 페이지에 들어가면 그 카테고리에 포함되는 글들의 태그만 표시되고, 태그별로 정리돼서 나타난다. 지금은 글이 몇개 없어서 이게 뭐야 할 수 있겠지만 글이 많아지고 겹치는 태그도 많아지면 ( 어차피 태그들은 내 관심사에 대한 키워드일 테니)
훨씬 멋지고 훌륭한 블로그가 될 것 같다.

후후 고생한 것 같다. 이젠 진짜로 인스타에 자랑해야지
